# 07. Databases in Python

In [9]:
import sqlite3 as sql
import pandas as pd

In [8]:
db = sql.connect('data\database.sqlite')

In [11]:
def run_query(query):
    return pd.read_sql_query(query,db)

In [12]:
 run_query("SELECT tbl_name FROM sqlite_master;")

  tbl_name
0  station
1   status
2     trip
3  weather

In [13]:
query = '''
SELECT start_station_name, end_station_name, duration FROM trip 
WHERE start_station_name = 'Paseo de San Antonio' 
LIMIT 5;
'''
run_query(query)

     start_station_name                   end_station_name  duration
0  Paseo de San Antonio                   Adobe on Almaden     12280
1  Paseo de San Antonio  San Jose Diridon Caltrain Station       454
2  Paseo de San Antonio               Paseo de San Antonio      1481
3  Paseo de San Antonio               Paseo de San Antonio      1475
4  Paseo de San Antonio  San Jose Diridon Caltrain Station       573

## 04. Advanced SQL queries

In [14]:
run_query("SELECT AVG(duration) AS 'Average Duration' FROM trip;")

   Average Duration
0       1107.949846

In [15]:
query='''
SELECT subscription_type, AVG(duration) AS 'Average Duration'  FROM trip 
GROUP BY subscription_type;
'''
run_query(query)

  subscription_type  Average Duration
0          Customer       3951.761329
1        Subscriber        590.048856

In [16]:
query = '''
SELECT station.city AS "City", COUNT(*) AS "Count"
FROM trip 
INNER JOIN station
ON trip.start_station_name = station.name
GROUP BY station.city;
'''
run_query(query)

            City   Count
0  Mountain View   18167
1      Palo Alto    6773
2   Redwood City    3366
3  San Francisco  592456
4       San Jose   37855

In [17]:
query = '''
SELECT start.city AS "Start city", end.city AS "End city", trip.duration
FROM trip
INNER JOIN station AS start
ON trip.start_station_name = start.name
INNER JOIN station AS end
ON trip.end_station_name = end.name
WHERE start.city != end.city
ORDER BY duration DESC
LIMIT 1;
'''
run_query(query)

  Start city       End city  duration
0  Palo Alto  Mountain View    611240

## 05. Exercise: SQL queries

In [18]:
# 1) What was the duration of the longest trip?
query = '''
SELECT max(duration) FROM trip 
;
'''
run_query(query)

   max(duration)
0       17270400

In [27]:
# 2) How many trips were ended at the station '2nd at South Park '?
query = '''
SELECT count(*) FROM trip 
where end_station_name like '2nd at South Park'
;
'''
run_query(query)

   count(*)
0     16843

In [28]:
# 3) How many trips had a duration between 1000 and 2000?
query = '''
SELECT count(*) FROM trip 
where duration <2000
and duration > 1000
;
'''
run_query(query)

   count(*)
0     56705

In [33]:
# 4) Which bike was used for the most trips?
query = '''
select bike_id, max(count) from (
SELECT bike_id, count(bike_id) as count FROM trip 
group by bike_ID
)
;
'''
run_query(query)

   bike_id  max(count)
0      392        2061

In [39]:
# 5) Which are the top five stations for the number of round trips? (round trips start and end at the same station).
squery = '''SELECT bidistinct start_station_nameROM trip 
growhere start_station_name = end_station_name
'limit 5'
run_query(query)

              start_station_name
0              2nd at South Park
1  Redwood City Caltrain Station
2       South Van Ness at Market
3        Mountain View City Hall
4       Commercial at Montgomery